<?php
/* vim: set fileencoding=cp932 autoindent noexpandtab ts=4 sw=4 sts=0 fdm=marker: */
/* mi: charset=Shift_JIS */

// p2 - 定型文リスト

/* ================================================================================
 * 書式：$CONSTANT['メニューに表示する名前'] = "定型文";
 * HTMLの特殊文字を実体参照で記述しなくてもよい。（最後に一括で変換）
 * ================================================================================ */


/*喜*/
$CONSTANT['ｷﾀ--!!'] = "ｷﾀ━━━━━━(ﾟ∀ﾟ)━━━━━━!!!!";
$CONSTANT['ｲｲ!'] = "（・∀・）ｲｲ!";
$CONSTANT['ｳﾏ-'] = "(ﾟдﾟ)ｳﾏ-";
$CONSTANT['ﾊｧﾊｧ;'] = "(;´д｀)ﾊｧﾊｧ";
$CONSTANT['ﾊｧﾊｧ*'] = "(*´Д`*)ﾊｧﾊｧ";
/*怒*/
$CONSTANT['ﾊｧ?'] = "(ﾟДﾟ)ﾊｧ?";
$CONSTANT['ｺﾞﾙｧ!!'] = "(ﾟДﾟ)ｺﾞﾙｧ!!";
/*哀*/
$CONSTANT['ｼｮﾎﾞｰﾝ '] = "(´･ω･｀)ｼｮﾎﾞｰﾝ";
$CONSTANT['ｳﾜｧｧﾝ!!'] = "ヽ(`Д´)ﾉｳﾜｧｧﾝ!!";
$CONSTANT['ｶﾞｸｶﾞｸﾌﾞﾙﾌﾞﾙ'] = "((((;ﾟДﾟ)))ｶﾞｸｶﾞｸﾌﾞﾙﾌﾞﾙ";
$CONSTANT['＿|￣|○'] = "＿|￣|○";
/*楽*/
$CONSTANT['ぃょぅ'] = "(=ﾟωﾟ)ﾉぃょぅ";
$CONSTANT['ﾏﾀｰﾘ'] = "（ ´∀｀）ﾏﾀｰﾘ";
$CONSTANT['ｽﾝｽﾝｽｰﾝ♪'] = "(・∀・) ｽﾝｽﾝｽｰﾝ♪";

/*AA*/
$CONSTANT['モナー'] =<<<EOC
　　　　∧＿∧
　　　　（　´∀｀） ＜オマエモナー
　　　　（　　　　）
　　　　｜ ｜　|
　　　　（_＿）＿）
EOC;

$CONSTANT['ギコ猫'] =<<<EOC
　　　　　　∧ ∧ 　／￣￣￣￣￣￣￣￣￣￣￣￣
～′ ￣￣( ﾟДﾟ)＜　逝ってよし！！
　 UU￣￣ U U　　＼＿＿＿＿＿＿＿＿＿＿＿＿＿
EOC;

$CONSTANT['スマンカッタ'] =<<<EOC
 　　　　　＿＿＿＿＿
 　　　 ／＿　　　　　　|
 　 　 /.　＼￣￣￣￣|
 　　/　　／　 ―　― |
 　　|　 /　　 　-　　- |
 　 ||| (6　　　　　　>　|
 　| | |　　　　 ┏━┓|　　 ／￣￣￣￣￣￣￣￣
 | | | | 　　　　┃─┃|　 ＜　正直、スマンカッタ。
 || | | | 　＼　┃　 ┃/　 　 ＼＿＿＿＿＿＿＿＿
 | || |　|　　　￣　￣|
EOC;

//特殊文字を実体参照に変換
$CONSTANT = array_map('htmlspecialchars', $CONSTANT);

?>
